using System;
using System.Collections.Generic;
using System.Text;

namespace Deepleo.ImageMerge
{
    /// <summary>
    /// 合并布局枚举
    /// </summary>
    public enum MergeLayoutEnum
    {
        /// <summary>
        /// 一张图片，如果小于目标尺寸放在中间
        /// </summary>
        Merge1C = 1,
        /// <summary>
        /// 2张图片，上下各1个长方形
        ///  ———————————————————
        /// |                  |
        /// |      Top  R1     |
        /// |                  |
        ///  ———————————————————
        /// |                  |
        /// |     Bottom   R2  |
        /// |                  |
        ///  ———————————————————
        /// </summary>
        Merge2TB = 2,

        /// <summary>
        /// 2张图片，左右各1个长方形
        ///  ———————————————————
        /// |         |        |
        /// |         |        |
        /// |         |        |
        /// |    R1   |   R2   |
        /// |         |        |
        /// |   Left  |  Right |
        /// |         |        |
        ///  ———————————————————
        /// </summary>
        Merge2LR = 3,

        /// <summary>
        /// 3张图片， 上面一个长方形，下面2个正方形并排
        ///  ———————————————————
        /// |                  |
        /// |         R1       |
        /// |                  |
        ///  ———————————————————
        /// |         |        |
        /// |    S1   |   S2   |
        /// |         |        |
        ///  ———————————————————
        /// </summary>
        Merge3T1B2 = 4,

        /// <summary>
        /// 3张图片，上面2个正方形并排，下面一个长方形
        ///  ———————————————————
        /// |         |        |
        /// |    S1   |   S2   |
        /// |         |        |
        ///  ———————————————————
        /// |                  |
        /// |         R1       |
        /// |                  |
        /// ———————————————————
        /// </summary>
        Merge3T2B1 = 5,

        /// <summary>
        /// 3张图片，上面2个正方形并排，下面一个长方形
        ///  ———————————————————
        /// |         |        |
        /// |         |    S1  |
        /// |         |        |
        /// |    R1   |—————————
        /// |         |        |
        /// |         |    S2  |
        /// |         |        |
        ///  ———————————————————
        /// </summary>
        Merge3L1R2 = 6,

        /// <summary>
        /// 3张图片，上面2个正方形并排，下面一个长方形
        ///  ———————————————————
        /// |         |        |
        /// |    S2   |        |
        /// |         |        |
        /// |—————————|    R1  |
        /// |         |        |
        /// |    S2   |        |
        /// |         |        |
        ///  ———————————————————
        /// </summary>
        Merge3L2R1 = 7,

        /// <summary>
        /// 4张图片，上面一个长方形，下面2个正方形并排
        ///  ———————————————————
        /// |         |        |
        /// |    S1   |   S2   |
        /// |         |        |
        ///  ———————————————————
        /// |         |        |
        /// |    S3   |   S4   |
        /// |         |        |
        ///  ———————————————————
        /// </summary>
        Merge4S = 8,

        /// <summary>
        /// 8张图片 上4 下4
        /// ————————————————————
        /// |    |    |    |    |
        /// |    |    |    |    |
        /// —————————————————————
        /// |    |    |    |    |
        /// |    |    |    |    |
        /// —————————————————————
        /// </summary>
        Merge8T4B4 = 9,

        /// <summary>
        /// 8张图片 左4右4
        /// ——————————— 
        /// |    |    |     
        /// |    |    |    
        /// ——————————— 
        /// |    |    |   
        /// |    |    |  
        /// ——————————— 
        /// |    |    |     
        /// |    |    |    
        /// ——————————— 
        /// |    |    |     
        /// |    |    |    
        /// ——————————— 
        /// </summary>
        Merge8L4R4 = 10,
    }
}
